app/Http/Controllers/Admin/NewsController.php

insert into `news` (`image_path`, `title`, `body`, `updated_at`, `created_at`) values ('', '8/30', 'こんばんは', '2020-09-02 11:52:19', '2020-09-02 11:52:19')
---
    public function create(Request $request) {

        // Varidationを行う
        $this->validate($request, News::$rules);

        $news = new News;
        $form = $request->all();

        // フォームから画像が送信されてきたら、保存して、$news->image_path に画像のパスを保存する
        if(isset($form['image'])) {
            $path = $request->file('image')->store('public/image');
            $news->image_path = basename($path);
        } else {
            $news->image_path = null;
        }

        // フォームから送信されてきた_tokenを削除する
        unset($form['_token']);
        // フォームから送信されてきたimageを削除する
        unset($form['image']);

        // データベースに保存する
        $news->fill($form)->save();

select * from `news` where `title` = 'すごいニュース'
select * from `news`
---
    public function index(Request $request) {
        $cond_title = $request->cond_title;
        if($cond_title != '') {
            $posts = News::where('title', $cond_title)->get();
        } else {
            $posts = News::all();

insert into `histories` (`news_id`, `edited_at`, `updated_at`, `created_at`) values (7, '2020-09-06 13:59:19', '2020-09-06 04:59:19', '2020-09-06 04:59:19')
---
    public function update(Request $request) {
        // Validation
        $this->validate($request, News::$rules);
        // News Modelからデータ取得
        $news = News::find($request->id);
        // 送信フォームデータの格納
        $news_form = $request->all();

        if(isset($news_form['image'])) {
            $path = $request->file('image')->store('public/image');
            $news->image_path = basename($path);
            unset($news_form['image']);
        } elseif(isset($request->remove)) {
            $news->image_path = null;
            unset($news_form['remove']);
        }

        unset($news_form['_token']);
        // 該当データの上書き保存
        $news->fill($news_form)->save();

        $history = new History;
        $history->news_id = $news->id;
        $history->edited_at = Carbon::now('Asia/Tokyo');
        $history->save();

delete from `news` where `id` = 1
---
    public function delete(Request $request) {

        $news = News::find($request->id);
        $news->delete();