app/Http/Controllers/Admin/ProfileController.php

    public function create(Request $request){

        $this->validate($request, Profile::$rules);

        $profile = new Profile;
        $form = $request->all();

        unset($form['_token']);

        $profile->fill($form)->save();
---
insert into `profiles` (`name`, `gender`, `hobby`, `introduction`, `updated_at`, `created_at`) values ('佐々木', '女性', '歌', 'こんにちは！', '2020-09-02 04:26:35', '2020-09-02 04:26:35')

    public function update(Request $request){
        $this->validate($request, Profile::$rules);
        $profile = Profile::find($request->id);
        $profile_form = $request->all();

        unset($profile_form['_token']);
        $profile->fill($profile_form)->save();

        $record = new Record;
        $record->profile_id = $profile->id;
        $record->edited_at = Carbon::now();
        $record->save();
---
update `profiles` set `introduction` = 'Hello!\r\nNice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.Nice to meet you.', `profiles`.`updated_at` = '2020-09-08 06:32:05' where `id` = 3
insert into `records` (`profile_id`, `edited_at`, `updated_at`, `created_at`) values (3, '2020-09-08 15:32:05', '2020-09-08 06:32:05', '2020-09-08 06:32:05')